#+PROPERTY: header-args :tangle yes

* Ruby
#+begin_src ruby :results output :tangle 01.rb
puts 'Hello, world.'
#+end_src

#+RESULTS:
: Hello, world.

#+begin_src ruby :results output :tangle 02.rb
str = 'Hello, Ruby.'
puts "Index of 'Ruby' in '#{str}' is #{str.index('Ruby')}"
#+end_src

#+RESULTS:
: Index of 'Ruby' in 'Hello, Ruby.' is 7

#+begin_src ruby :results output :tangle 03.rb
i = 0
until i == 10
  puts 'Anand Magaji'
  i = i + 1
end
#+end_src

#+RESULTS:
#+begin_example
Anand Magaji
Anand Magaji
Anand Magaji
Anand Magaji
Anand Magaji
Anand Magaji
Anand Magaji
Anand Magaji
Anand Magaji
Anand Magaji
#+end_example


#+begin_src ruby :results output :tangle 04.rb
j = 0
until j == 10
  j = j + 1
  puts "This is sentence number #{j}"
end
#+end_src

#+RESULTS:
#+begin_example
This is sentence number 1
This is sentence number 2
This is sentence number 3
This is sentence number 4
This is sentence number 5
This is sentence number 6
This is sentence number 7
This is sentence number 8
This is sentence number 9
This is sentence number 10
#+end_example

#+begin_src ruby :results output :tangle 05.rb
puts 'Starting Guessing Game'
num = rand(10)
guessed = false
until guessed
    puts 'Type a number between 0-9'
    guess = gets
    guess = guess.to_i
    if guess == num
        puts 'You guessed it!'
        guessed = true
    else
        puts 'Your guess is high!' if guess > num
        puts 'Your guess is low!' if guess < num
    end
end
#+end_src

#+RESULTS:
: Starting Guessing Game
: Type a number between 0-9
: Your guess is low!
